// 大吉のテキスト
const daikichi = [
  "リリースしたソフトウェアにバグが見つかりますが、再現性が低いためユーザーも上司も誰ひとり気付かないでしょう。見なかったことにするのが吉。",
  "GitHub Sponsors を通じて太っ腹なスポンサーがつきます。これであなたの OSS 開発は安泰です!!",
]

// 中吉のテキスト
const tyukichi = [
  "git でコンフリクトが発生します!! が、今回は上手く解消できるでしょう。今回は・・・",
]

// 小吉のテキスト
const shokichi = [
  "リリース前のソフトウェアにバグが見つかります。貴方のお勤め先が上流の企業ならばそれほど大きな問題にはなりませんが、三次請けよりも下流の場合はご愁傷様でございます。",
  "開発の要件定義が綿飴のようにふわっふわです。手遅れにならないうちに手を打っておくのが吉。",
]

// 吉のテキスト
const kichi = [
  "リファクタリングに成功してプログラムが爆速に!!サクサク動いて気持ちいいーーー!!",
  "関わっているプロジェクトから何だか香ばしい匂いがします。炎上する前になんとか逃げるのが吉。",
]

// 凶のテキスト
const kyo = [
  "リリースしたソフトウェアに致命的な欠陥が見つかり、それが原因で顧客の機密情報が派手に流出します。仕様で押し通すにはいささか無理がありますので、潔く腹をくくりましょう。",
]

// 大凶のテキスト
const daikyo = [
  "daikyo",
  "daikyo",
  "daikyo",
]

export { daikichi, tyukichi, shokichi, kichi, kyo, daikyo};